EA/src/Documents/СписаниеПретензии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>СписаниеПретензии</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Претензии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Отдел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОснования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОснования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Претензия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Претензии</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

EA/src/AccumulationRegisters/Претензии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>Претензии</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Претензия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Претензии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПретензии</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Претензия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

EA/src/Documents/СписаниеПретензии/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.Претензии.Очистить();
	Движения.Претензии.Записывать = Истина;
	ЗапросПретензии = Новый Запрос;
	ЗапросПретензии.Текст = 
	"ВЫБРАТЬ
	|	СписаниеПретензииТовары.Партия,
	|	СписаниеПретензииТовары.Претензия,
	|	СписаниеПретензииТовары.Ссылка.Отдел
	|ПОМЕСТИТЬ втПретензииБезПустых
	|ИЗ
	|	Документ.СписаниеПретензии.Товары КАК СписаниеПретензииТовары
	|ГДЕ
	|	СписаниеПретензииТовары.Ссылка = &Ссылка
	|	И СписаниеПретензииТовары.Партия <> ЗНАЧЕНИЕ(Справочник.Партии.ПустаяСсылка)
	|	И СписаниеПретензииТовары.Претензия <> ЗНАЧЕНИЕ(Справочник.Претензии.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПретензииОстатки.Склад,
	|	ПретензииОстатки.Партия КАК ПартияПретензии,
	|	ПретензииОстатки.Претензия,
	|	ПретензииОстатки.ДокументПретензии,
	|	ПретензииОстатки.СуммаОстаток КАК Сумма,
	|	ПретензииОстатки.КоличествоОстаток КАК Количество
	|ИЗ
	|	РегистрНакопления.Претензии.Остатки(
	|			&Дата,
	|			(Партия, Претензия, Склад) В
	|				(ВЫБРАТЬ
	|					втПретензииБезПустых.Партия,
	|					втПретензииБезПустых.Претензия,
	|					втПретензииБезПустых.Отдел
	|				ИЗ
	|					втПретензииБезПустых КАК втПретензииБезПустых)) КАК ПретензииОстатки";
	ЗапросПретензии.УстановитьПараметр("Ссылка",Ссылка);
	ЗапросПретензии.УстановитьПараметр("Дата",Новый Граница(МоментВремени(),ВидГраницы.Включая));

	ТЗОстатковПретензий = ЗапросПретензии.Выполнить().Выгрузить();

	Для каждого строка из Товары цикл
		
		ОстаткиПоПартииПретензии = ТЗОстатковПретензий.Скопировать(Новый Структура("ПартияПретензии,Претензия",Строка.Партия,Строка.Претензия));		
		КолП = Строка.Количество;
		Для каждого остаток из ОстаткиПоПартииПретензии цикл
			Кол = остаток.Количество;
			Сум = остаток.Сумма;
			Если Кол = 0 Тогда Продолжить КонецЕсли;
			СписатьКол = Мин(Кол, КолП);   
			Если СписатьКол = Кол Тогда
				СписатьСумму = остаток.Сумма;
			Иначе                                            
				СписатьСумму = СписатьКол*строка.Цена;
			КонецЕсли;
			Движение = Движения.Претензии.ДобавитьРасход();
			Движение.Период = Дата;
			Движение.Партия=строка.Партия;
			Движение.Претензия=строка.Претензия;
			Движение.Склад=остаток.Склад;  
			Движение.ДокументПретензии=остаток.ДокументПретензии;
			Движение.Количество=СписатьКол; 
			Движение.Сумма=СписатьСумму;
			Движение.Период = Дата;
			КолП = КолП-СписатьКол;  
			Если КолП=0 Тогда 
				Прервать 
			КонецЕсли;
		КонецЦикла; 

		
	КонецЦикла;
	
КонецПроцедуры
